package main

// Задание 1: Целочисленное деление
// Условие:
// Создай переменные `a := 7`, `b := 2`.
// Выведи:
// * результат `a / b`
// * результат `float64(a) / float64(b)`
// Ожидаемый результат:


// Задание 2: Применение логических операторов
// Условие:
// Пусть есть переменные:
// age := 25
// isStudent := false
// Напиши выражение, которое проверяет:
// * возраст от 18 до 30 включительно
// * и пользователь **не студент**
// Если условие выполняется — напечатай `"OK"`, иначе `"Access denied"`.


// Задание 3: Префиксное отрицание
// Условие:
// Создай переменную `valid := false`.
// Выведи результат выражения `!valid`.


// Задание 4: Индексация и срез
// Условие:
// Создай срез `[]string{"go", "rust", "python", "c++"}`.
// Выведи:
// * элемент с индексом 2
// * срез из первых двух элементов


// Задание 5: Приоритет операторов
// Условие:
// Пусть `x := 2`, `y := 3`, `z := 4`.
// Вычисли:
// result := x + y * z
// result2 := (x + y) * z
// Выведи оба результата и объясни, почему они разные.
